Repository: jimregan/citizens-information-raw
Catalog: en-ga/www.citizensinformation.ie/ga/money_and_tax/personal_finance/debt/mabs_service.html.txt.tmx
Source language: en
Languages: ga

source: Money Advice and Budgeting Service
ga: An tSeirbhís Buiséadaithe agus Comhairle Airgid

source: • Services provided by MABS
ga: • Seirbhísí a chuireann SBCA ar fáil

source: • What you can do yourself
ga: • Cad is féidir a dhéanamh tú féin

source: • How MABS can help you
ga: • Conas is féidir le SBCA cabhrú leat

source: If you’re behind in your mortgage payments, you may be worried about losing your home
ga: Má tá fadhbanna agat le do mhorgáiste a íoc, d’fhéadfá bheith buartha go gcaillfeá do theach

source: If you can’t - talk to MABS
ga: Munar féidir leat – labhair le MABS

source: MABS now has a dedicated confidential, free, and independent mortgage arrears service
ga: Tá seirbhís tiomnaithe neamhspleách, faoi rún, saor in aisce ag MABS anois i leith riaráistí morgáiste

source: MABS is a one-stop-shop for mortgage debt advice and referral
ga: Is ionad ilfhreastail é MABS le haghaidh comhairle agus tarchur i leith fiachais mhorgáiste

source: No matter what your situation is, MABS will help you work out the next steps
ga: Is cuma cad é do chás, cabhróidh MABS leat an chéad chéim eile a aimsiú

source: Take control of what happens next
ga: Glac smacht ar cad a tharlóidh anois

source: Call MABS today on 0761 07 2000 for independent information, advice and referral
ga: Cuir glao ar MABS inniu ar 0761 07 2000 chun faisnéis, comhairle agus tarchur neamhspleách a fháil

source: The Money Advice and Budgeting Service (MABS) is a free and confidential service for people who are having problems with money management and debt
ga: Is seirbhís rúnda agus saor in aisce í an tSeirbhís Buiséadaithe agus Comhairle Airgid (SBCA) (MABS) dóibh siúd atá i bhfiacha nó go bhfuil fadhb acu ag bainistiú airgid

source: MABS money advisers provide advice and practical help to people to review their debts, deal with their creditors and work out solutions
ga: Cabhraíonn comhairleoirí airgid SBCA le daoine scrúdú a dhéanamh ar a gcuid fiachais, deileáil lena gcreidiúnaithe agus teacht ar mhodhanna socraithe

source: A series of measures to support people in mortgage arrears has enhanced the role of MABS, to include a Dedicated Mortgage Arrears service and a court mentor service – see below
ga: Tugann beartais nua do dhaoine a bhfuil riaráistí morgáiste acu ról níos mó do SBCA, ina mheasc seirbhís tiomnaithe i leith riaráistí morgáiste agus seirbhís meantóireachta sa chúirt - féach thíos

source: In addition, MABS is centrally involved in a new aid and advice scheme for people in serious mortgage arrears, as part of Abhaile, the national Mortgage Arrears Resolution Service. This service was launched in October 2016
ga: Tá MABS ina phointe rochtaine don scéim nua Abhaile, chun cabhrú le daoine atá dócmhainneach agus i riaráistí morgáiste comhairle neamhspleách dlí agus airgeadais a fháil

source: Services provided by MABS
ga: Seirbhísí a chuireann SBCA ar fáil

source: MABS offers a range of services, as follows:
ga: Cuireann SBCA raon seirbhísí ar fáil:

source: Your debts may become a problem for many reasons, such as job loss, illness, extra expenses, or loans that you can’t pay
ga: D'fhéadfadh raon chúiseanna a bheith i gceist más rud é go bhfuil fadhbanna fiachais agat - mar shampla, post a chailleadh, tinneas sa chlann, breis billí na roimhe seo, aisíocaíochtaí iasachta nach féidir a dhéanamh

source: A MABS money adviser can:
ga: Féadfaidh comhairleoir airgid SBCA:

source: • Help you deal with your debts and make out a budget
ga: • Cabhrú leat do fhiacha a láimhseáil agus buiséad a réiteach duit féin

source: • Review your income to make sure that you are not missing any entitlements
ga: • Scrúdú a dhéanamh ar do ioncam le déanamh cinnte go bhfuil tú ag fáil gach a bhfuil ag dul duit

source: • Contact your creditors for you, with offers of payment that you can afford
ga: • Labhairt le do chreidiúnaithe ar do shon, chun socruithe aisíocaíochta a thairiscint, ar féidir leat a íoc

source: • Help you decide on the best way to make the payments
ga: • Cabhrú leat a chinneadh conas is fearr faoi an mbealach is fearr na h-aisíocaíochtaí a dhéanamh

source: MABS has agreed a protocol (pdf) with a the Banking and Payments Federation of Ireland (BPFI) to help people to manage their debt repayments in an affordable way
ga: Chomhaontaigh an SBCA agus Cónaidhm Bhaincéireachta agus Íocaíochtaí na hÉireann (BPFI) prótacal (pdf) chun cabhrú le daoine a n-aisíocaíochtaí fiachais a bhainistiú ar bhealach inacmhainne

source: The lenders involved have committed to work with MABS to help customers to address their debt problems and agree a sustainable repayment plan
ga: Tá na hiasachtóirí atá bainteach tiomnaithe chun oibriú leis an SBCA chun cabhrú le custaiméirí dul i ngleic lena bhfadhbanna fiachais agus comhaontú a dhéanamh ar phlean inbhuanaithe aisíocaíochta

source: The protocol allows for write-off of some debt, at the lender’s discretion
ga: Ceadaíonn an prótacal roinnt fiachais a dhíscríobh, faoi lánrogha an iasachtóra

source: It does not apply to mortgage debt
ga: Ní bhaineann sé le fiachas morgáiste

source: MABS can also help you to agree a sustainable repayment plan with other creditors (who are not part of the protocol)
ga: Chomh maith leis sin, féadfaidh an SBCA cabhrú leat comhaontú a dhéanamh ar phlean inbhuanaithe aisíocaíochta le creidiúnaithe eile (nach bhfuil mar chuid den phrótacal)

source: If you cannot pay your debts
ga: Munar féidir leat d'fhiacha a íoc

source: Most MABS services are registered as Approved Intermediaries with the Insolvency Service of Ireland (ISI) and can assess whether a Debt Relief Notice is an appropriate solution for you and bring you through the application process
ga: Tá formhór na Seirbhísí SBCA ceadaithe mar Idirghabhálaithe Faofa le Seirbhís Dócmhainneachta na hÉireann agus is féidir leo a mheasúnu an mbeadh Fógra um Fhaoiseamh Fiachais (DRN) oiriúnach duit agus cabhrú leat tríd an próiseas iarratais

source: MABS can also advise you on how to access other personal insolvency options
ga: Is féidir leo tú a tharchur chuig ceann eile de na roghanna um dhócmhainneacht phearsanta a bheadh oiriúnach duit

source: If you are having difficulty paying your mortgage, MABS can advise you on your options
ga: Má tá deacrachtaí agat le do mhorgáiste a íoc, féadfaidh leis an SBCA comhairle a chur ort ar do chuid roghanna

source: The Central Bank’s Code of Conduct on Mortgage Arrears requires mortgage lenders to operate a Mortgage Arrears Resolution Process (MARP) for people in mortgage difficulty
ga: Ceanglaítear i gCód Iompair an Bhainc Cheannais um Riaráistí Morgáiste go n-oibríonn iasachtóirí morgáiste Próiseas Réitigh Riaráistí Morgáiste (PRRM) do dhaoine a bhfuil deacracht mhorgáiste acu

source: The lender must refer you to sources of information and advice, such as MABS and keepingyourhome.ie
ga: Ní mór don iasachtóir thú a atreorú chuig foinsí faisnéise agus comhairle, ar nós an SBCA agus keepingyourhome.ie

source: MABS publishes a series of guides and leaflets on dealing with mortgage debt
ga: Foilsíonn an SBCA sraith treoracha agus bileog ar dhéileáil le fiachas morgáiste

source: As part of the MARP, you must assemble all of your financial details and fill out a standard financial statement (SFS) (pdf) for your lender, so that they can assess your financial position and work out the best solution
ga: Mar chuid den PRRM, ní mór duit do chuid sonraí airgeadais go léir a bhailiú agus ráiteas caighdeánach airgeadais (RCA) (pdf) a chomhlánú do d’iasachtóir, ionas gur féidir leo measúnú a dhéanamh ar do staid airgeadais agus an réiteach is fearr a dheimhniú

source: MABS can help you to complete this statement
ga: Féadfaidh an SBCA cabhrú leat an ráiteas seo a chomhlánú

source: It has worked with the Central Bank to develop a consumer guide (pdf) to completing an SFS
ga: D’oibrigh siad leis an mBanc Ceannais chun treoir do thomhaltóirí (pdf) a fhorbairt maidir le RCA a chomhlánú

source: Dedicated Mortgage Arrears (DMA) service
ga: Seirbhís Riaráistí Morgáiste Tiomnaithe (RMT)

source: In addition to the standard services that MABS provides, over 20 MABS offices now have specialist mortgage arrears advisers, who can help mortgage holders to assess an offer made by their mortgage lender and can negotiate with the lender if required
ga: Anuas ar na seirbhísí caighdeánacha a sholáthraíonn an SBCA, tá comhairleoirí speisialaithe um riaráistí morgáiste anois i mbreis agus 20 oifigí den SBCA, ar féidir leo cabhrú le sealbhóirí morgáiste chun measúnú a dhéanamh ar thairiscint a rinne a n-iasachtóir morgáiste agus idirbheartaíocht a dhéanamh leis an iasachtóir, más gá

source: For homeowners who are facing court proceedings to repossess their homes, a national network of court mentors is now in place
ga: I dtaobh úinéirí tí a mbeidh imeachtaí cúirte i ndán dóibh chun a dtithe a athshealbhú, tá líonra náisiúnta de mheantóirí cúirte i bhfeidhm anois

source: This service offers support and advice on court proceedings, as well as direct referral back to MABS where a case is adjourned
ga: Cuireann an tseirbhís seo tacaíocht agus comhairle ar fáil i dtaobh imeachtaí cúirte, anuas ar atreorú díreach siar go dtí an SBCA, sa chás go ndéantar cás a chur ar athló

source: MABS works in close collaboration with the Insolvency Service of Ireland (ISI) to deliver the court mentor service. Read more about these 2 services
ga: Oibríonn an SBCA i gcomhar le Seirbhís Dócmhainneachta na hÉireann (SDÉ) chun seirbhís mheantóir cúirte a sholáthar

source: This service was launched in October 2016
ga: Is féidir leat níos mó a léamh faoin dá sheirbhís anseo

source: MABS also provides money management education and produces a range of publications
ga: Ina theannta sin, soláthraíonn an SBCA oideachas bainistíochta airgeadais agus cuireann sé réimse foilseachán i dtoll a chéile

source: These and other useful resources, including a self-help tool, are available on mabs.ie
ga: Tá fáil ar na hacmhainní seo agus ar acmhainní eile, treoir féinchabhrach ina measc, ar mabs.ie

source: What you can do yourself
ga: Cad is féidir a dhéanamh tú féin

source: The most important step you can take is to contact your creditors immediately to let them know that you are having difficulties
ga: Tá sé fíor-thabhachtach dul i dteangmháil le do chreidiúnaithe agus fios a chur orthu go bhfuil fadhbanna agat

source: Then you will be able to work with them to deal with the situation
ga: Ansin beidh tú in ann obair in éineacht leo chun dul i ngleic le do chuid fadhbanna

source: Otherwise the problems and the pressure from creditors will just get worse
ga: Seachas sin, rachadh na fadhbanna agus an brú ó do chreidiúnaithe in ndonas

source: You can use the MABS self-help tool to work through the following steps:
ga: Is féidir an treoir féinchabhrach a úsáid chun na céimeanna seo a leanúint:

source: Make a list of all your debts
ga: Déan liosta de do chuid fiachais go léir

source: Check that each debt is in your name
ga: Seiceáil go bhfuil gach fiachas i d’ainm féin

source: Identify the debts needing immediate attention (for example, mortgage arrears)
ga: Sainaithin na fiachais a dteastaíonn aird láithreach uatha (riaráistí morgáiste, mar shampla)

source: Get in touch with the lenders immediately - preferably in writing – to tell them that you are assessing your situation and ask them to put a temporary hold on your repayments
ga: Déan teagmháil leis na hiasachtóirí láithreach – is fearr seo a dhéanamh i scríbhinn – lena insint dóibh go bhfuil measúnú á dhéanamh agat ar do chás agus iarr orthu do chuid aisíocaíochtaí a chur ar coinneáil shealadach

source: There is a sample letter on the MABS website
ga: Tá litir shamplach ar láithreán gréasáin an SBCA

source: List how much money is coming into your household each week (or month) and how much is going out
ga: Liostaigh cé mhéid airgid atá ag teacht isteach i do theaghlach gach seachtain (nó gach mí) agus cé mhéid atá á chaitheamh agat

source: You can get useful documents like a blank budget sheet and spending diary (pdf) from the MABS website or ask for them through the MABS helpline
ga: Féadfaidh tú cáipéisí áisiúla a fháil ar nós bileog bhán bhuiséid agus dialann chaiteachais (pdf) ó láithreán gréasáin an SBCA nó is féidir leat iarraidh orthu trí líne chabhrach an SBCA

source: Deal with the debt
ga: Déileáil leis an bhfiachas

source: Write to the lender, making an offer of the amount you can afford to pay and explaining your financial situation
ga: Scríobh chuig an iasachtóir, ina ndéanann tú tairiscint ar an méid is féidir leat a íoc agus ina míníonn tú do chás airgeadais

source: The MABS website has a sample letter of offer and blank financial statements
ga: Tá litir shamplach thairisceana agus ráitis bhána airgeadais ar láithreán gréasáin an SBCA

source: Organise a method of paying the agreed amount
ga: Eagraigh modh chun an méid comhaontaithe a íoc

source: You can do this in various ways, such as direct debit or through internet banking
ga: Féadfaidh tú seo a dhéanamh ar bhealaí éagsúla, ar nós trí dhochar díreach nó baincéireacht idirlín

source: How MABS can help you
ga: Conas is féidir le SBCA cabhrú leat

source: MABS provides a confidential service and will not discuss your situation with anyone without your signed agreement
ga: Cuireann SBCA seirbhís saor in aisce ar fáil agus ní phléifidh an comhairleoir airgid do chás le duine eile ar bith, ach amháin ma aontaíonn tú (i scríbhinn) go dtarlódh a leithéid

source: MABS will give you information and support you in making decisions, but will not tell you what to do about your debts and payments
ga: Tabharfaidh SBCA faisnéis agus tacaíocht duit chun cinntí a dhéanamh, agus ní inseoidh sé duit cad atá le déanamh faoi do chuid fiachas agus íocaíochtaí

source: You are the person who decides
ga: Is tusa an duine a dhéanann cinneadh

source: If you contact the MABS Helpline - see ' Where to apply' below - an adviser will talk you through your money concerns and give you some advice
ga: Má dhéanann tú teagmháil le Líne Chabhrach an SBCA – féach ‘Cá ndéanfaidh mé iarratas? ’ thíos

source: They can send you some information and materials to help you to address your money problems
ga: Tabharfaidh comhairleoir treoir duit i dtaobh do chuid buarthaí airgid agus cuirfidh sé/sí roinnt comhairle ort

source: You may be able to deal with the issues yourself at this stage, or you may need to see a money adviser face-to-face in a MABS office
ga: Féadfaidh siad roinnt faisnéise agus ábhar a sheoladh chugat chun cabhrú leat dul i ngleic le do chuid fadhbanna airgid

source: The face-to-face service is by appointment only
ga: Seirbhís trí choinne, amháin, is ea an tseirbhís seo

source: When you contact MABS, it is important to tell them about anything very urgent, for example, if you are being taken to court or your electricity is to be disconnected
ga: Déan cinnte de, nuair a dhéanann tú teangmháil le SCBA, go n'insíonn tú dóibh faoi aon ní tabhachtach, mar shampla, má tá creidiúnaí ag cur cás cúirte ort nó má tá an comhlacht gáis nó leictreachais tar éis tú a ghearradh ón gcóras

source: In cases like these, you may be able to get an emergency appointment
ga: I gcásanna mar seo, déanfar coinne éigeandála leat, de ghnáth

source: To be able to help you, the MABS adviser will need as much information as possible about your financial situation
ga: Chun cabhrú leat, caithfidh an comhairleoir airgid gach eolas is féidir a fháil mar gheall ar do chúinsí airgeadais

source: You will need to collect any bills, statements, account books, payslips, or social welfare receipts that you have, as well as any letters that your creditors have sent, even if you haven’t opened them
ga: Beidh ort gach bille, ráiteas, leabhar chuntais, duillín pá, nó admháil leasa shoisialaigh a chuimsiú, chomh maith le gach litir a sheol do chreidiúnaithe chugat, fiú munar éirigh leat go fóill iad a oscailt

source: • Look at all your income and ensure that you are getting all your entitlements
ga: • Súil a chaitheamh ar d’ioncam go léir agus cinntiú go bhfuil do chuid teidlíochtaí go léir á bhfáil agat

source: • Check through all your debts and ensure that you are the person who is liable for them
ga: • D’fhiachais go léir a sheiceáil agus cinntiú gur tú féin an duine atá faoi dhliteanas íoc astu

source: • Help you to work out how much you need to cover your everyday needs
ga: • Cabhrú leat a dheimhniú cé mhéid a theastaíonn uait chun íoc as do chuid riachtanais laethúla

source: • Give you advice on budgeting
ga: • Comhairle a chur ort ar bhuiséadú

source: • Draw up a financial statement for use when dealing with your creditors
ga: • Ráiteas airgeadais a chur i dtoll a chéile a úsáidfear nuair atáthar ag déileáil le do chuid creidiúnaithe

source: • Help you to decide which of your debts have the highest priority
ga: • Cabhrú leat cinneadh a dhéanamh ar na fiachais atá agat a dtugtar an tús áite dóibh

source: • Help you to work out a payment plan – how much you can afford to pay each week off each debt
ga: • Cabhrú leat plean íocaíochta a dheimhniú – cé mhéid is féidir leat a íoc gach seachtain as gach fiachas

source: • Negotiate with your creditors on your behalf, if you wish
ga: • Déan idirbheartaíocht le do chuid creidiúnaithe ar do shon, más mian leat

source: • Provide support while you deal with your debts
ga: • Tacaíocht a sholáthar fad a dhéileálann tú le do chuid fiachas

source: • Refer you to other services and contact them on your behalf, if you wish
ga: • Thú a atreorú chuig seirbhísí eile agus teagmháil a dhéanamh leo thar do cheann, más mian leat

source: • Help to arrange to pay regular amount off your debts, as agreed with your creditors
ga: • Cabhrú leat méid rialta a íoc ó do chuid fiachas, faoi mar a comhaontaíodh le do chuid creidiúnaithe

source: • Refer you to someone who can help with a personal insolvency option if appropriate
ga: • Tú a atreorú chuig duine éigin ar féidir leo cabhrú leat le roghanna um dhócmhainneacht phearsanta, más cuí

source: The services that MABS provides are free. You do not have to pay for any advice, assistance or information
ga: Is seirbhís saor in aisce í SCBA agus níl aon táille maidir le faisnéis, comhairle nó cúnamh

source: Use the MABS self-help tool as a starting point to assessing your situation and dealing with your debts
ga: Bain úsáid as an treoir féinchabhrach mar phointe tosaigh le do staid a mheas agus le deileáil le do chuid fiachais

source: Ring the MABS Helpline: 0761 07 2000 (9am - 8pm, Monday - Friday) or email: helpline@mabs.ie
ga: Is féidir leat freisin glao a chur ar Líne Chabhrach SCBA: 0761 07 2000 (Luan go hAoine idir 9rn agus 8in) nó ríomhphoist a sheol:adh chuig helpline@mabs.ie

source: Contact your local MABS office for an appointment to meet a money adviser
ga: Is féidir leat teagmháil a dhéanamh le d’oifig áitiúil SBCA chun coinne a dhéanamh le comhairleoir airgid
